---
title: PlanTopology
classe: Autodesk.Revit.DB.PlanTopology
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# PlanTopology

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `PlanCircuitSet Circuits { get; }` | `planTopology.Circuits` | PlanCircuitSet |
| `Level Level { get; }` | `planTopology.Level` | Level |
| `Phase Phase { get; }` | `planTopology.Phase` | Phase |
| `ICollection<ElementId> GetRoomIds()` | `planTopology.GetRoomIds()` | ICollection<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```